# GetSubelement Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..GetSubelement Method
DocumentEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetSubelement(String) | Gets the subelement referenced by a unique id string.  (Inherited from Document.) |
| GetSubelement(Reference) | Gets the subelement referenced by the input reference.  (Inherited from Document.) |
| GetSubelement(ElementId, Int32) | Gets the subelement referenced by a parent id and subelement id.  (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace